#!/usr/bin/env sh

echo '------------------------------------'
echo '|        Сборка helpers            |'
echo '------------------------------------'

cd ./helpers || return

echo '------------------------------------'
echo 'Пакет "Utils"'
echo '------------------------------------'
cd ./utils && npx yarn build


echo '------------------------------------'
echo '|        Сборка packages           |'
echo '------------------------------------'

cd ../../packages || return

echo '------------------------------------'
echo 'Пакет "Request"'
echo '------------------------------------'
cd ./request && npx yarn build

echo '------------------------------------'
echo 'Пакет "Dialog"'
echo '------------------------------------'
cd ../dialog && npx yarn build

echo '------------------------------------'
echo 'Пакет "Numeral"'
echo '------------------------------------'
cd ../numeral && npx yarn build


echo ''
echo '------------------------------------'
echo '|        Сборка libraries          |'
echo '------------------------------------'

cd ../../libraries || return

echo '------------------------------------'
echo 'Библиотека "Kit"'
echo '------------------------------------'
cd ./kit && npx yarn build

echo '------------------------------------'
echo 'Библиотека "Design"'
echo '------------------------------------'
cd ../design && npx yarn build


echo ''
echo '------------------------------------'
echo '|        Сборка widgets            |'
echo '------------------------------------'

cd ../../widgets || return

echo '------------------------------------'
echo 'Виджет "bucket"'
echo '------------------------------------'
cd ./bucket && npx yarn build

echo '------------------------------------'
echo 'Библиотека "Design"'
echo '------------------------------------'
cd ../../libraries/design && npx yarn build

echo '------------------------------------'
echo '|        Сборка layouts            |'
echo '------------------------------------'

cd ../../layouts || return

echo '------------------------------------'
echo 'Пакет "Default"'
echo '------------------------------------'
cd ./default && npx yarn build

echo '------------------------------------'
echo 'Пакет "No-cart"'
echo '------------------------------------'
cd ../no-cart && npx yarn build


echo ''
echo '------------------------------------'
echo '|        Сборка modules            |'
echo '------------------------------------'

cd ../../modules || return

echo '------------------------------------'
echo 'Модуль "Main"'
echo '------------------------------------'
cd ./main && npx yarn build

echo '------------------------------------'
echo 'Модуль "Groups"'
echo '------------------------------------'
cd ../groups && npx yarn build

echo '------------------------------------'
echo 'Модуль "Categories"'
echo '------------------------------------'
cd ../categories && npx yarn build

echo '------------------------------------'
echo 'Модуль "Products"'
echo '------------------------------------'
cd ../products && npx yarn build

echo '------------------------------------'
echo 'Модуль "Product"'
echo '------------------------------------'
cd ../product && npx yarn build

echo '------------------------------------'
echo 'Модуль "Checkout"'
echo '------------------------------------'
cd ../checkout && npx yarn build


echo ''
echo '------------------------------------'
echo '|        Сборка app client         |'
echo '------------------------------------'


echo '------------------------------------'
echo 'Виджет "Store"'
echo '------------------------------------'
cd ../../libraries/store && npx yarn build

cd ../../apps || return

echo '------------------------------------'
echo 'Модуль "Client"'
echo '------------------------------------'
cd ./client && npx yarn build

exit 0
